epccs/AVR-Dx_DFP/edc/AVR128DA48.PIC
        <edc:DCRDef edc:_addr="0x1051" edc:access="nnnnnnnn" edc:cname="BODCFG" edc:factorydefault="0x00" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="SLEEP" edc:desc="BOD Operation in Sleep Mode" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="BOD disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="BOD enabled in continiuous mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLE" edc:desc="BOD enabled in sampled mode" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="ACTIVE" edc:desc="BOD Operation in Active Mode" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="BOD disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="BOD enabled in continiuous mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLE" edc:desc="BOD enabled in sampled mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="ENABLEWAIT" edc:desc="BOD enabled in continiuous mode. Execution is halted at wake-up until BOD is running." edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="SAMPFREQ" edc:desc="BOD Sample Frequency" edc:nzwidth="0x1">
                <edc:DCRFieldSemantic edc:cname="128Hz" edc:desc="Sample frequency is 128 Hz" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="32Hz" edc:desc="Sample frequency is 32 Hz" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="LVL" edc:desc="BOD Level" edc:nzwidth="0x3">
                <edc:DCRFieldSemantic edc:cname="BODLEVEL0" edc:desc="1.9V" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL1" edc:desc="2.45V" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL2" edc:desc="2.7V" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL3" edc:desc="2.85V" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1052" edc:access="-----nnn" edc:cname="OSCCFG" edc:factorydefault="0x00" edc:impl="0x7" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="CLKSEL" edc:desc="Frequency Select" edc:nzwidth="0x3">
                <edc:DCRFieldSemantic edc:cname="OSCHF" edc:desc="1-32MHz internal oscillator" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="OSC32K" edc:desc="32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 0x1"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:AdjustPoint edc:_addr="0x1053" edc:offset="0x2"/>
        <edc:DCRDef edc:_addr="0x1055" edc:access="nnn-nn-n" edc:cname="SYSCFG0" edc:factorydefault="0xC0" edc:impl="0xED" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="EEPROM Save" edc:nzwidth="0x1">
                <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:DCRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:DCRFieldDef edc:cname="RSTPINCFG" edc:desc="Reset Pin Configuration" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="GPIO mode" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="RST" edc:desc="Reset mode" edc:when="(field &amp; 0x3) == 0x2"/>
              </edc:DCRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:DCRFieldDef edc:cname="CRCSEL" edc:desc="CRC Select" edc:nzwidth="0x1">
                <edc:DCRFieldSemantic edc:cname="CRC32" edc:desc="Enable CRC32" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="CRC16" edc:desc="Enable CRC16" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="CRCSRC" edc:desc="CRC Source" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="FLASH" edc:desc="CRC of full Flash (boot, application code and application data)" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="BOOT" edc:desc="CRC of boot section" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="BOOTAPP" edc:desc="CRC of application code and boot sections" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:DCRFieldSemantic edc:cname="NOCRC" edc:desc="No CRC" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1056" edc:access="-----nnn" edc:cname="SYSCFG1" edc:factorydefault="0x00" edc:impl="0x7" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="SUT" edc:desc="Startup Time" edc:nzwidth="0x3">
                <edc:DCRFieldSemantic edc:cname="0MS" edc:desc="0 ms" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="1MS" edc:desc="1 ms" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="2MS" edc:desc="2 ms" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="4MS" edc:desc="4 ms" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="8MS" edc:desc="8 ms" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="16MS" edc:desc="16 ms" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="32MS" edc:desc="32 ms" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="64MS" edc:desc="64 ms" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1057" edc:access="nnnnnnnn" edc:cname="CODESIZE" edc:factorydefault="0x00" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE"/>
        <edc:DCRDef edc:_addr="0x1058" edc:access="nnnnnnnn" edc:cname="BOOTSIZE" edc:factorydefault="0x00" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE"/>
      </edc:ConfigFuseSector>
      <edc:GPRDataSector edc:beginaddr="0x4000" edc:endaddr="0x8000" edc:isexecutable="false" edc:regionid="INTERNAL_SRAM"/>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x100C" edc:regionid="IO">
        <edc:SFRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="DIR" edc:nzwidth="0x8" ltx:memberofperipheral="VPORTA"/>
        <edc:SFRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="OUT" edc:nzwidth="0x8" ltx:memberofperipheral="VPORTA"/>
        <edc:SFRDef edc:_addr="0x2" edc:access="nnnnnnnn" edc:cname="IN" edc:nzwidth="0x8" ltx:memberofperipheral="VPORTA"/>
        <edc:SFRDef edc:_addr="0x3" edc:access="nnnnnnnn" edc:cname="INTFLAGS" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="VPORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="VPORTA">
              <edc:SFRFieldDef edc:cname="INT" edc:desc="Pin Interrupt" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
