epccs/AVR-Dx_DFP/edc/AVR128DA48.PIC
        <edc:SFRDef edc:_addr="0x5E6" edc:access="--nnnnnn" edc:cname="TCAROUTEA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCA0" edc:desc="TCA0 Signals" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PORTA" edc:desc="PA0, PA1, PA2, PA3, PA4, PA5" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PORTB" edc:desc="PB0, PB1, PB2, PB3, PB4, PB5" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="PORTC" edc:desc="PC0, PC1, PC2, PC3, PC4, PC5" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="PORTD" edc:desc="PD0, PD1, PD2, PD3, PD4, PD5" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="PORTE" edc:desc="PE0, PE1, PE2, PE3, PE4, PE5" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="PORTF" edc:desc="PF0, PF1, PF2, PF3, PF4, PF5" edc:when="(field &amp; 0x7) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="PORTG" edc:desc="PG0, PG1, PG2, PG3, PG4, PG5" edc:when="(field &amp; 0x7) == 0x6"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCA1" edc:desc="TCA1 Signals" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PORTB" edc:desc="PB0, PB1, PB2, PB3, PB4, PB5" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PORTC" edc:desc="PC4, PC5, PC6" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="PORTE" edc:desc="PE4, PE5, PE6" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="PORTG" edc:desc="PG0, PG1, PG2, PG3, PG4, PG5" edc:when="(field &amp; 0x7) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E7" edc:access="----nnnn" edc:cname="TCBROUTEA" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCB0" edc:desc="TCB0 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PA2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PF4" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCB1" edc:desc="TCB1 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PA3" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PF5" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCB2" edc:desc="TCB2 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PC0" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PB4" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCB3" edc:desc="TCB3 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PB5" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PC1" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E8" edc:access="-----nnn" edc:cname="TCDROUTEA" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCD0" edc:desc="TCD0 Signals" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PA4, PA5, PA6, PA7" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PB4, PB5, PB6, PB7" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="PF0, PF1, PF2, PF3" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="ALT3" edc:desc="PG4, PG5, PG6, PG7" edc:when="(field &amp; 0x7) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E9" edc:access="-----nnn" edc:cname="ACROUTEA" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="AC0" edc:desc="Analog Comparator 0 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC1" edc:desc="Analog Comparator 1 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2" edc:desc="Analog Comparator 2 Output" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
