epccs/AVR-Dx_DFP/edc/AVR128DA48.PIC
        <edc:SFRDef edc:_addr="0x867" edc:access="nnnnnnnn" edc:cname="CTRLC" edc:mclr="00000011" edc:nzwidth="0x8" edc:por="00000011" ltx:memberofperipheral="USART3"/>
        <edc:SFRDef edc:_addr="0x868" edc:access="nnnnnnnnnnnnnnnn" edc:cname="BAUD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USART3"/>
        <edc:SFRDef edc:_addr="0x86A" edc:access="nn------" edc:cname="CTRLD" edc:impl="0xC0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="ABW" edc:desc="Auto Baud Window" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="WDW0" edc:desc="18% tolerance" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="WDW1" edc:desc="15% tolerance" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="WDW2" edc:desc="21% tolerance" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="WDW3" edc:desc="25% tolerance" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x86B" edc:access="n------n" edc:cname="DBGCTRL" edc:impl="0x81" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="ABMBP" edc:desc="Autobaud majority voter bypass" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x86C" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="IREI" edc:desc="IrDA Event Input Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x86D" edc:access="nnnnnnnn" edc:cname="TXPLCTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="TXPL" edc:desc="Transmit pulse length" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x86E" edc:access="-nnnnnnn" edc:cname="RXPLCTRL" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="RXPL" edc:desc="Receiver Pulse Lenght" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x86F" edc:offset="0x11"/>
        <edc:SFRDef edc:_addr="0x880" edc:access="rrrrrrrr" edc:cname="RXDATAL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
              <edc:SFRFieldDef edc:cname="DATA" edc:desc="RX Data" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x881" edc:access="rr---rrr" edc:cname="RXDATAH" edc:impl="0xC7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
              <edc:SFRFieldDef edc:cname="DATA8" edc:desc="Receiver Data Register" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:desc="Parity Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:desc="Receive Complete Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x882" edc:access="nnnnnnnn" edc:cname="TXDATAL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
              <edc:SFRFieldDef edc:cname="DATA" edc:desc="Transmit Data Register" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x883" edc:access="-------n" edc:cname="TXDATAH" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
              <edc:SFRFieldDef edc:cname="DATA8" edc:desc="Transmit Data Register (CHSIZE=9bit)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x884" edc:access="nnnnn-nn" edc:cname="STATUS" edc:impl="0xFB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
              <edc:SFRFieldDef edc:cname="WFB" edc:desc="Wait For Break" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BDF" edc:desc="Break Detected Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ISFIF" edc:desc="Inconsistent Sync Field Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSIF" edc:desc="Receive Start Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DREIF" edc:desc="Data Register Empty Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="Transmit Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:desc="Receive Complete Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
