epccs/AVR-Dx_DFP/edc/AVR128DA48.PIC
        <edc:SFRDef edc:_addr="0xB25" edc:access="------nn" edc:cname="INTCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB2">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB26" edc:access="------nn" edc:cname="INTFLAGS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB2">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB27" edc:access="-------r" edc:cname="STATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB2">
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB28" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB2">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB29" edc:access="nnnnnnnn" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCB2"/>
        <edc:SFRDef edc:_addr="0xB2A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCB2"/>
        <edc:SFRDef edc:_addr="0xB2C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CCMP" edc:nzwidth="0x10" ltx:memberofperipheral="TCB2"/>
        <edc:AdjustPoint edc:_addr="0xB2E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xB30" edc:access="-nnnnnnn" edc:cname="CTRLA" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_PEP" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER/2" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="TCA0" edc:desc="Use CLK_TCA from TCA0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Count on event edge" edc:when="(field &amp; 0x7) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="TCA1" edc:desc="Use CLK_TCA from TCA1" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SYNCUPD" edc:desc="Synchronize Update" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CASCADE" edc:desc="Cascade two timers" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run Standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB31" edc:access="-nnn-nnn" edc:cname="CTRLB" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="CNTMODE" edc:desc="Timer Mode" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INT" edc:desc="Periodic Interrupt" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TIMEOUT" edc:desc="Periodic Timeout" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Input Capture Event" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FRQ" edc:desc="Input Capture Frequency measurement" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="PW" edc:desc="Input Capture Pulse-Width measurement" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="FRQPW" edc:desc="Input Capture Frequency and Pulse-Width measurement" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Shot" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="PWM8" edc:desc="8-bit PWM" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CCMPEN" edc:desc="Pin Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCMPINIT" edc:desc="Pin Initial State" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ASYNC" edc:desc="Asynchronous Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB32" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xB34" edc:access="-n-n---n" edc:cname="EVCTRL" edc:impl="0x51" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="CAPTEI" edc:desc="Event Input Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="EDGE" edc:desc="Event Edge" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Input Capture Noise Cancellation Filter" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB35" edc:access="------nn" edc:cname="INTCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB36" edc:access="------nn" edc:cname="INTFLAGS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB37" edc:access="-------r" edc:cname="STATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB38" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB39" edc:access="nnnnnnnn" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCB3"/>
        <edc:SFRDef edc:_addr="0xB3A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCB3"/>
        <edc:SFRDef edc:_addr="0xB3C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CCMP" edc:nzwidth="0x10" ltx:memberofperipheral="TCB3"/>
        <edc:AdjustPoint edc:_addr="0xB3E" edc:offset="0x42"/>
        <edc:SFRDef edc:_addr="0xB80" edc:access="-nnnnnnn" edc:cname="CTRLA" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNCPRES" edc:desc="Synchronization prescaler" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Selected clock source divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Selected clock source divided by 2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Selected clock source divided by 4" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Selected clock source divided by 8" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CNTPRES" edc:desc="counter prescaler" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Sync clock divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Sync clock divided by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Sync clock divided by 32" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="clock select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="OSCHF" edc:desc="Internal High-Frequency Oscillator" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PLL" edc:desc="PLL" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External Clock" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CLKPER" edc:desc="Peripheral Clock" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB81" edc:access="------nn" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="WGMODE" edc:desc="Waveform generation mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="ONERAMP" edc:desc="One ramp mode" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="TWORAMP" edc:desc="Two ramp mode" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="FOURRAMP" edc:desc="Four ramp mode" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="DS" edc:desc="Dual slope mode" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB82" edc:access="nn--n-nn" edc:cname="CTRLC" edc:impl="0xCB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="CMPOVR" edc:desc="Compare output value override" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AUPDATE" edc:desc="Auto update" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFTY" edc:desc="Fifty percent waveform" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CMPCSEL" edc:desc="Compare C output select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="PWMA" edc:desc="PWM A output" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PWMB" edc:desc="PWM B output" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CMPDSEL" edc:desc="Compare D output select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="PWMA" edc:desc="PWM A output" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PWMB" edc:desc="PWM B output" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB83" edc:access="nnnnnnnn" edc:cname="CTRLD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="CMPAVAL" edc:desc="Compare A value" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CMPBVAL" edc:desc="Compare B value" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB84" edc:access="n--nnnnn" edc:cname="CTRLE" edc:impl="0x9F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="SYNCEOC" edc:desc="synchronize end of cycle strobe" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="synchronize strobe" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESTART" edc:desc="Restart strobe" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCAPTUREA" edc:desc="Software Capture A Strobe" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCAPTUREB" edc:desc="Software Capture B Strobe" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="DISEOC" edc:desc="Disable at end of cycle" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB85" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0xB88" edc:access="nn-n-n-n" edc:cname="EVCTRLA" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="TRIGEI" edc:desc="Trigger event enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTION" edc:desc="event action" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Event trigger a fault" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Event trigger a fault and capture" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EDGE" edc:desc="edge select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="FALL_LOW" edc:desc="The falling edge or low level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="RISE_HIGH" edc:desc="The rising edge or high level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CFG" edc:desc="event config" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="NEITHER" edc:desc="Neither Filter nor Asynchronous Event is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Input Capture Noise Cancellation Filter enabled" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Asynchronous Event output qualification enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
